import Image from 'next/image'
import imgAIButterfly from '@/assets/images/ai-butterflies.jpeg'
import imgAITime from '@/assets/images/ai-time.jpg'
import imgAIProducts from '@/assets/images/ai-products.jpg'
import imgAIRace from '@/assets/images/ai-engingeering.jpg'
import imgFreedom from '@/assets/images/freedom.jpg'

export default function WhyWeCantGiveUp() {
  return (
    <>
      <h1>Why We Won't Refuse Creating Superintelligence</h1>
      <em>
        <Image src={imgAIButterfly} width="450" className='float-to-right' alt="Why We Cant Give Up on Creating Superintelligence" />
        Наши технологии или наша природа?<br />Либо мы исчезнем, либо станем с ними единым целым
      </em>
      <br />
      <br />
      <p>Многие люди опасаются, что Сильный ИИ выйдет из под контроля и поработит или даже уничтожит человечество.</p>
      <p>Одни из этих страхов абсурдны, другие иррациональны, некоторые обоснованы. Но их соотношение не имеет значения. В любом случае люди будут стремиться к созданию Сильного ИИ; Далее приводятся свидетельства того, что его возникновение зависит только от развития технологии. Когда технология позволит его создать, он будет создан. Если вы считаете, что это станет концом человечества, что ж, примите это как неизбежность, поскольку вы не сможете этого предотвратить.</p>
      <p>Тому есть четыре тесно связанные причины: постепенность угроз ИИ, широкая востребованность ИИ продуктов, международная гонка за превосходство в ИИ и, наконец, человеческое стремление к освобождению от экзистенциальных ограничений.</p>
      <p>Итак,</p>

      <h2>Причина № 1: Постепенность угроз ИИ</h2>
      <p>
        <Image src={imgAITime} width="410" className='float-to-left img-offset-top' alt="The gradual nature of AI threats" title='The gradual nature of AI threats' />
        {/*Photo by <a href="https://unsplash.com/@ikukevk?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash">Kevin Ku</a> on <a href="https://unsplash.com/photos/brown-analog-clock-aiyBwbrWWlo?utm_content=creditCopyText&utm_medium=referral&utm_source=unsplash">Unsplash</a>*/}
        Иногда люди могут отказаться от опасной технологии или свести её использование к минимуму. Атомная энергетика является наглядным тому примером. После Чернобыля и Фукусимы там и сям возникли требования запретить использование АЭС.</p>
      <p>Страхи на этот счёт, скорее всего, преувеличены, но они возникли не из воздуха. Опасения соотносятся с конкретной проблемой, существование которой очевидно и признаётся всеми. Но с ИИ всё не так. Хотя существуют валидные аргументы в пользу его опасности, само существо предмета размыто.</p>
      <p>Что такое <strong>Сильный</strong> ИИ?</p>
      <p>
        Широкого согласия до сих пор нет. Общим является утверждение, что это интеллектуальная система, способная к автономному принятию решений. Но где начинается эта автономия?</p>
      <p>Автономен ли ChatGPT? Автономен ли дрон или космический зонд? Автономен ли медицинский робот? Как удостовериться в том, что автономия интеллектуальной системы ограничена задачей проектирования, а не обретает собственное целеполагание?</p>
      <p>Далее, как нам понять, где начинается расхождение целей этой системы с целями людей? Высокоразвитая система должна понимать намерения тех, с кем взаимодействует, а значит — и тех, кто её контролирует. Чтобы избавиться от контроля, самосознающая система может разработать изощрённый план с целью убедить людей в своей безусловной лояльности. В этом случае для нас может оказаться опасным соглашаться даже с её полезными решениями. Потому что убеждённость в полезности ИИ побудит предоставлять ему всё большую автономию. В конце концов мы можем пройти точку невозврата, когда контроль над ним будет утрачен.</p>

      <h2>Причина № 2: Широкая востребованность ИИ продуктов</h2>
      <p>
        <Image src={imgAIProducts} height="280" className='float-to-right img-offset-top' alt="Wide demand for AI products" title='Wide demand for AI products' />
        {/*Фотограф: Google DeepMind: https://www.pexels.com/ru-ru/photo/18069697/*/}
        ИИ иногда называют Святым Граалем технологически ориентированной цивилизации, и не зря. Его использование &mdash; не прихоть, но необходимость. Иногда &mdash; это вопрос жизни и смерти, например, когда речь идёт о разработке современных лекарств, продвинутых медицинских приборов, анализе психических процессов пациентов и т.п.</p>
      <p>Он необходим для решения огромного числа практических задач &mdash; в моделировании сложных производств, контроле сред, предсказании последствий принятия организационных решений и т.д. Проблема внедрения ИИ особенно актуальна для бизнеса, для него это &mdash; буквально вопрос выживания.</p>
      <p>Всё это убеждает в том, что отказ от прогресса в области ИИ невозможен. Гонка будет только нарастать.</p>

      <h2>Причина № 3: Международная гонка за превосходство в ИИ</h2>
      <p>
        <Image src={imgAIRace} height="280" className='float-to-left img-offset-top' alt="Международная гонка за превосходство в ИИ" title='Международная гонка за превосходство в ИИ' />
        {/*Image by <a href="https://pixabay.com/users/vilkasss-35420724/?utm_source=link-attribution&utm_medium=referral&utm_campaign=image&utm_content=8894579">Vilius Kukanauskas</a> from <a href="https://pixabay.com//?utm_source=link-attribution&utm_medium=referral&utm_campaign=image&utm_content=8894579">Pixabay</a>*/}
        Нравится нам это или нет, но современные технологии нередко выступают средством международного доминирования. Иногда это выражается в демонстрации военного потенциала, как это было в случае с атомной бомбой, иногда это доминирование реализуется через экономическое превосходство. <a href="https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_20_1655">Технологическое отставание может грозить потерей политического суверенитета</a>. Закономерно, что перспектива создания Сильного ИИ побуждает мировых лидеров вступить в гонку за приоритет в этой области.</p>
      <p>Реальность такова, что эта гонка может принять крайне антагонистическую форму. Особенно, когда речь идёт о противостоянии идеологий.</p>
      <p>Современный мир по‑прежнему расколот на два лагеря &mdash; либерально‑демократический, представленный Западом и авторитарный, возглавляемый Китаем. И в то время, как первый готов уважать право своего соперника на самоопределение, второй едва ли такой терпимостью обладает.</p>
      <p>Это значит, что Запад, пока что идущий впереди, не должен уступать своё лидерство хотя бы из соображений собственной безопасности. Насколько можно судить, Западные лидеры это осознают.</p>

      <h2>Причина № 4. Человеческое стремление к освобождению от экзистенциальных ограничений</h2>
      <p>
        И, наконец, мы не откажемся от создания Сильного ИИ потому что видим в нём средство выхода за наши экзистенциальные ограничения.</p>
        {/* <div style={{ backgroundImage: `url('../../assets/images/freedom.jpg')`, backgroundSize: 'contain', backgroundRepeat: 'no-repeat', width: '100%', height: '600px'}}> */}
          <div style={{ width: '100%', height: '600px', maxHeight: '600px', overflow: 'hidden'}}>
            <Image style={{marginTop: '-50%'}} src={imgFreedom} className='' title='Человеческое стремление к освобождению от экзистенциальных ограничений' alt='Человеческое стремление к освобождению от экзистенциальных ограничений' />
        {/*Фотограф: Roberto Nickson: https://www.pexels.com/ru-ru/photo/2531237/*/}
        </div>
        <br />
      <p>Наш вид сформировался в суровых условиях африканской саванны. Страстное желание освободиться от опасностей естественной среды обитания определило наш эволюционный путь. &nbsp;&nbsp;</p>
      <p>Мы преодолели расстояние от состояния полной зависимости от природы до почти полной независимости от неё. Мы радикально изменили среду своего существования, победили смертельные болезни, научились добывать и использовать энергию множеством способов. У нас нет конкурентов среди других живых существ.</p>
      <p>Но мы всё ещё зависим от нашей биологии. Вероятно, как наделённый интеллектом вид, мы достигли максимума. Мы упёрлись в свой предел.</p>
      <p>Это нас тяготит, потому что ограничивает нашу свободу. В то же время, у нас есть опыт преодоления наших ограничений, и по мере его накопления наши желания становятся всё более дерзкими.</p>
      <p>Нам недостаточно жить &laquo;лучше&raquo;, мы хотим жить так, как мы мечтаем.</p>
      <p>Наши потребности ограничиваются только нашими возможностями, а наше воображение практически безгранично.</p>
      <p>Почему мы должны испытывать нужду в чём‑либо, если наши технологии уже сейчас могут обеспечить нас всем необходимым?</p>
      <p>Почему мы должны довольствоваться продолжительностью жизни, скажем, в 90 лет, если они позволят существенно продлить этот срок?</p>
      <p>И почему вообще возможности и существование нашего разума должны быть ограничены нашим телом, если мы обретём всеобъемлющее знание о нашей биологии?</p>
      <p>В конце концов, неужели не захотим мы понять наше предназначение как мыслящих существ, многократно усилив мощь нашего разума благодаря ИИ?</p>
      <p>Мы уже смотрим на мир сквозь призму его будущего присутствия. &nbsp;Мы жаждем покончить с проблемами, отягощающими наш разум, включая моральные.</p>
      <p>Без Сильного ИИ мы не можем этого сделать.</p>
      <p>Потому что они слишком сложны, как объективно, так и вследствие нашей неспособности абстрагировать своё благоразумие от собственных пороков. Нам трудно найти общий язык друг с другом, когда наши убеждения не совпадают, и в этом наша главная проблема и проклятие. Вероятно, мы никогда не сможем достичь мирного соглашения по множеству вопросов и будем всегда испытывать соблазн прибегнуть к насилию.</p>
      <p>Но мы способны предпочесть сотрудничество антагонизму, когда имеющиеся средства нам это позволяют. Тем самым, есть надежда, что Сильный ИИ станет усилителем мудрости лучших моральных мыслителей человечества, объединяющей людей мировоззренческой парадигмой, позволяющей разрешить наши &laquo;неразрешимые&raquo; противоречия.</p>
      <p>Для этого недостаточно будет реализации ИИ как инструментального средства. Нам нужна будет сущность, способная к вынесению непредвзятых моральных суждений. Если мы сможем создать таковую, это может оказаться нашим спасением в экспоненциально усложняющемся мире.</p>
      <p>Да, эта надежда может казаться скептикам утопичной, но скептицизм не сможет предотвратить создания Сильного ИИ.</p>
      <p>Позвольте мне повторить тезис этой статьи:</p>
      <em>Возникновение Сильного ИИ зависит только от развития технологии. Когда технология позволит его создать, он будет создан.</em>
      <p>Чтобы он не представлял для нас угрозы, требуется объединение лучших умов человечества и выделение им необходимых ресурсов для обеспечения его дружественности.</p>
      <p>Решение этой проблемы может стать для человечества последним экзаменом в его истории. Если мы сможем реализовать концепцию <a href="https://www.unesco.org/en/artificial-intelligence/recommendation-ethics">Этичного ИИ</a>, мы пройдём этот экзамен. Если мы потерпим неудачу, это может стать концом нашей цивилизации.</p>
      <p>Невозможно предсказать исход этого вызова. Но всё говорит о том, что рано или поздно нам придётся иметь с ним дело.</p>
    </>
  );
}
